юв_гит_/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.ПроизводствоИзделий</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеЗаказов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказанныеИзделия</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Производство</name>
      <type>
        <types>DocumentRef.Производство</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

юв_гит_/src/InformationRegisters/Прайслист/Прайслист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Прайслист</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

юв_гит_/src/Enums/СостояниеЗаказов/СостояниеЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЗаказов</name>
  <enumValues>
    <name>Заказан</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

юв_гит_/src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Module.bsl
//комментарий пример
&НаКлиенте
Процедура ЗаказанныеИзделияПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.ЗаказанныеИзделия.ТекущиеДанные;
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаказанныеИзделияСпецификацияПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.ЗаказанныеИзделия.ТекущиеДанные;
	ТекСтрокаТЧ.Цена = ПолучитьЦенуНаСервере(ТекСтрокаТЧ.Изделие, ТекСтрокаТЧ.Спецификация);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНаСервере(Изделие,Спецификация)
	РегПрайслист = РегистрыСведений.Прайслист.ПолучитьПоследнее(ТекущаяДата(),Новый Структура ("Изделие, Спецификация", Изделие, Спецификация));
	Возврат РегПрайслист.Цена;
Конецфункции
//Привет, я Наташа! Что-то написала хихи 02.06.25
&НаКлиенте
Процедура ЗаказанныеИзделияКоличествоПриИзменении(Элемент)
	ТекСтрокаТЧ = Элементы.ЗаказанныеИзделия.ТекущиеДанные;
	РасчетСуммыСтроки.СуммаСтрокиТЧ(ТекСтрокаТЧ);
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Состояние = Перечисления.СостояниеЗаказов.ПустаяСсылка() Тогда
		Объект.Состояние = Перечисления.СостояниеЗаказов.Заказан;
	КонецЕсли;
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура Подбор(Команда)
	АдресИзделийВХранилище = ПоместитьИзделияВХранилище();
	ПараметрыПодбора = Новый Структура("АдресИзделийВХранилище", АдресИзделийВХранилище);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораИзделий",ПараметрыПодбора,ЭтаФорма);
КонецПроцедуры
Функция ПоместитьИзделияВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ЗаказанныеИзделия.Выгрузить(),
											УникальныйИдентификатор);
КонецФункции
#КонецОбласти

 &НаКлиенте
 Процедура ОчиститьТЧ() Экспорт
	 Объект.ЗаказанныеИзделия.Очистить();
 КонецПроцедуры 
 
 &НаКлиенте
 Процедура ОбработкаПодбора(Изделие,Спецификация,Количество,Цена,Сумма) Экспорт
 	СтрокаЗаказанныеИзделия              = Объект.ЗаказанныеИзделия.Добавить();
 	СтрокаЗаказанныеИзделия.Изделие        = Изделие;
 	СтрокаЗаказанныеИзделия.Спецификация = Спецификация;
 	СтрокаЗаказанныеИзделия.Количество   = Количество;
 	СтрокаЗаказанныеИзделия.Цена         = Цена;	
 	СтрокаЗаказанныеИзделия.Сумма        = Сумма;
 КонецПроцедуры
